{
    "Email": "Email",
    "Date of birth": "2 criteria, western astrology as well as age difference. Its better if the man is older.",
    "Nationality": "Are they culturally close",
    "Your height": "The man should be taller than the woman",
    "How would you describe your personality? (Check all that apply)": "Use the MBTI Framework of compatibility on personality types",
    "What are your hobbies and interests? (Check all that apply)": "Hobbies and interest. They should be compatible",
    "Tell us about your hobbies:": "Hobbies and interest. They should be compatible",
    "What are your favorite types of music or artists?": "What are your favorite types of music or artists? They represent comatible",
    "Do you have any dietary preferences or restrictions?": "Do you have any dietary preferences or restrictions? Can these people live together",
    "What are you looking for in a partner? (Check all that apply)": "What are you looking for in a partner? Are they what each other is looking for for a successful relationship",
    "Explain what kind of relationship you want:": "Explain what kind of relationship you want:",
    "Do you have a preference for your partner's age range?": "Do you have a preference for your partner's age range?",
    "Do you have a preference for your partner's ethnicity?": "Are they the same preference",
    "What is your current relationship status?": "What is your current relationship status?",
    "What is your occupation?": "Can people with these two occupations live together happily",
    "How important are shared cultural or religious values to you?": "How important are shared cultural or religious values to you? Are both answers the same",
    "Do you have a preference for your partner's religion?(Specify if Yes)": "Do you have a preference for your partner's religion?If both are yes, are they the same",
    "Do you have any pets? If yes, please specify.": "Do you have any pets? Do these people match",
    "Do you smoke?": "Do you smoke? Can both answers live together",
    "Do you drink alcohol?": "Do you drink alcohol? Can both answers live together",
    "What is a fun fact about yourself?": "What is a fun fact about yourself? Do these facts represent compatible people"
}

